backend/tests/LoadTests/results/analytics-load-20260502-223627.txt

          /\      |ΓÇ╛ΓÇ╛| /ΓÇ╛ΓÇ╛/   /ΓÇ╛ΓÇ╛/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ΓÇ╛ΓÇ╛\  
   /          \   |  |\  \ |  (ΓÇ╛)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: .\analytics-advanced-load.js
        output: -

     scenarios: (100.00%) 3 scenarios, 6 max VUs, 25s max duration (incl. graceful stop):
              * smoke: 5 looping VUs for 20s (exec: smokeSuite, gracefulStop: 5s)
              * baseline: Up to 1 looping VUs for 3s over 3 stages (gracefulRampDown: 0s, exec: baselineSuite, startTime: 12s, gracefulStop: 5s)
              * stress: Up to 1 looping VUs for 3s over 3 stages (gracefulRampDown: 0s, exec: stressSuite, startTime: 24s, gracefulStop: 5s)


running (01.0s), 5/6 VUs, 0 complete and 0 interrupted iterations
smoke      [   5% ] 5 VUs    01.0s/20s
baseline ΓÇó [   0% ] waiting  11.0s
stress   ΓÇó [   0% ] waiting  23.0s

running (02.0s), 5/6 VUs, 5 complete and 0 interrupted iterations
smoke      [  10% ] 5 VUs    02.0s/20s
baseline ΓÇó [   0% ] waiting  10.0s
stress   ΓÇó [   0% ] waiting  22.0s

running (03.0s), 5/6 VUs, 10 complete and 0 interrupted iterations
smoke      [  15% ] 5 VUs    03.0s/20s
baseline ΓÇó [   0% ] waiting  09.0s
stress   ΓÇó [   0% ] waiting  21.0s

running (04.0s), 5/6 VUs, 15 complete and 0 interrupted iterations
smoke      [  20% ] 5 VUs    04.0s/20s
baseline ΓÇó [   0% ] waiting  08.0s
stress   ΓÇó [   0% ] waiting  20.0s

running (05.0s), 5/6 VUs, 20 complete and 0 interrupted iterations
smoke      [  25% ] 5 VUs    05.0s/20s
baseline ΓÇó [   0% ] waiting  07.0s
stress   ΓÇó [   0% ] waiting  19.0s

running (06.0s), 5/6 VUs, 23 complete and 0 interrupted iterations
smoke      [  30% ] 5 VUs    06.0s/20s
baseline ΓÇó [   0% ] waiting  06.0s
stress   ΓÇó [   0% ] waiting  18.0s

running (07.0s), 5/6 VUs, 23 complete and 0 interrupted iterations
smoke      [  35% ] 5 VUs    07.0s/20s
baseline ΓÇó [   0% ] waiting  05.0s
stress   ΓÇó [   0% ] waiting  17.0s

running (08.0s), 5/6 VUs, 23 complete and 0 interrupted iterations
smoke      [  40% ] 5 VUs    08.0s/20s
baseline ΓÇó [   0% ] waiting  04.0s
stress   ΓÇó [   0% ] waiting  16.0s

running (09.0s), 5/6 VUs, 23 complete and 0 interrupted iterations
smoke      [  45% ] 5 VUs    09.0s/20s
baseline ΓÇó [   0% ] waiting  03.0s
stress   ΓÇó [   0% ] waiting  15.0s

running (10.0s), 5/6 VUs, 23 complete and 0 interrupted iterations
smoke      [  50% ] 5 VUs    10.0s/20s
baseline ΓÇó [   0% ] waiting  02.0s
stress   ΓÇó [   0% ] waiting  14.0s

running (11.0s), 5/6 VUs, 23 complete and 0 interrupted iterations
smoke      [  55% ] 5 VUs    11.0s/20s
baseline ΓÇó [   0% ] waiting  01.0s
stress   ΓÇó [   0% ] waiting  13.0s

running (12.1s), 6/6 VUs, 23 complete and 0 interrupted iterations
smoke      [  60% ] 5 VUs    12.1s/20s
baseline   [   0% ] 1/1 VUs  0.0s/1.0s
stress   ΓÇó [   0% ] waiting  11.9s

running (13.0s), 6/6 VUs, 23 complete and 0 interrupted iterations
smoke      [  65% ] 5 VUs    13.0s/20s
baseline   [  95% ] 1/1 VUs  1.0s/1.0s
stress   ΓÇó [   0% ] waiting  11.0s

running (14.1s), 5/6 VUs, 23 complete and 1 interrupted iterations
smoke      [  71% ] 5 VUs    14.1s/20s
baseline Γ£ô [ 100% ] 1/1 VUs  1s
stress   ΓÇó [   0% ] waiting  09.9s

running (15.0s), 5/6 VUs, 23 complete and 1 interrupted iterations
smoke      [  75% ] 5 VUs    15.0s/20s
baseline Γ£ô [ 100% ] 1/1 VUs  1s
stress   ΓÇó [   0% ] waiting  09.0s

running (16.0s), 5/6 VUs, 24 complete and 1 interrupted iterations
smoke      [  80% ] 5 VUs    16.0s/20s
baseline Γ£ô [ 100% ] 1/1 VUs  1s
stress   ΓÇó [   0% ] waiting  08.0s

running (17.0s), 5/6 VUs, 24 complete and 1 interrupted iterations
smoke      [  85% ] 5 VUs    17.0s/20s
baseline Γ£ô [ 100% ] 1/1 VUs  1s
stress   ΓÇó [   0% ] waiting  07.0s

running (18.0s), 5/6 VUs, 24 complete and 1 interrupted iterations
smoke      [  90% ] 5 VUs    18.0s/20s
baseline Γ£ô [ 100% ] 1/1 VUs  1s
stress   ΓÇó [   0% ] waiting  06.0s

running (19.0s), 5/6 VUs, 24 complete and 1 interrupted iterations
smoke      [  95% ] 5 VUs    19.0s/20s
baseline Γ£ô [ 100% ] 1/1 VUs  1s
stress   ΓÇó [   0% ] waiting  05.0s

running (20.0s), 5/6 VUs, 24 complete and 1 interrupted iterations
smoke    Γåô [ 100% ] 5 VUs    20s
baseline Γ£ô [ 100% ] 1/1 VUs  1s
stress   ΓÇó [   0% ] waiting  04.0s

running (21.0s), 5/6 VUs, 24 complete and 1 interrupted iterations
smoke    Γåô [ 100% ] 5 VUs    20s
baseline Γ£ô [ 100% ] 1/1 VUs  1s
stress   ΓÇó [   0% ] waiting  03.0s

running (22.0s), 5/6 VUs, 24 complete and 1 interrupted iterations
smoke    Γåô [ 100% ] 5 VUs    20s
baseline Γ£ô [ 100% ] 1/1 VUs  1s
stress   ΓÇó [   0% ] waiting  02.0s

running (23.0s), 5/6 VUs, 24 complete and 1 interrupted iterations
smoke    Γåô [ 100% ] 5 VUs    20s
baseline Γ£ô [ 100% ] 1/1 VUs  1s
stress   ΓÇó [   0% ] waiting  01.0s

running (24.0s), 5/6 VUs, 24 complete and 1 interrupted iterations
smoke    Γåô [ 100% ] 5 VUs    20s
baseline Γ£ô [ 100% ] 1/1 VUs  1s
stress   ΓÇó [   0% ] waiting  00.0s

running (25.0s), 6/6 VUs, 24 complete and 1 interrupted iterations
smoke    Γåô [ 100% ] 5 VUs    20s
baseline Γ£ô [ 100% ] 1/1 VUs  1s
stress     [  98% ] 1/1 VUs  1.0s/1.0s

     Γ£ù status is 200 (alert-events)
      Γå│  85% ΓÇö Γ£ô 24 / Γ£ù 4
     Γ£ù status is 200 (heatmap)
      Γå│  96% ΓÇö Γ£ô 24 / Γ£ù 1
     Γ£ô status is 200 (trends)
     Γ£ô status is 200 (tenant-summary)
     Γ£ù status is 200 (slo-status)
      Γå│  95% ΓÇö Γ£ô 23 / Γ£ù 1

     checks.........................: 95.19% Γ£ô 119      Γ£ù 6  
     data_received..................: 51 kB  2.0 kB/s
     data_sent......................: 28 kB  1.1 kB/s
   Γ£ù failures.......................: 4.80%  Γ£ô 6        Γ£ù 119
     http_req_blocked...............: avg=993.12┬╡s min=0s       med=0s     max=23.64ms p(90)=0s       p(95)=262.79┬╡s
     http_req_connecting............: avg=125.33┬╡s min=0s       med=0s     max=9.13ms  p(90)=0s       p(95)=0s      
   Γ£ù http_req_duration..............: avg=493.17ms min=512.7┬╡s  med=1.64ms max=10.09s  p(90)=69.21ms  p(95)=88.92ms 
       { expected_response:true }...: avg=10.75ms  min=512.7┬╡s  med=1.6ms  max=92.85ms p(90)=32.2ms   p(95)=69.61ms 
   Γ£ù http_req_failed................: 4.80%  Γ£ô 6        Γ£ù 119
     http_req_receiving.............: avg=174.91┬╡s min=0s       med=0s     max=1.02ms  p(90)=768.58┬╡s p(95)=959.85┬╡s
     http_req_sending...............: avg=0s       min=0s       med=0s     max=0s      p(90)=0s       p(95)=0s      
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s     max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=493ms    min=512.59┬╡s med=1.58ms max=10.09s  p(90)=68.62ms  p(95)=88.72ms 
     http_reqs......................: 125    4.994424/s
     iteration_duration.............: avg=1.48s    min=1s       med=1.01s  max=11.13s  p(90)=1.24s    p(95)=1.28s   
     iterations.....................: 24     0.958929/s
     vus............................: 6      min=5      max=6
     vus_max........................: 6      min=6      max=6


running (25.0s), 0/6 VUs, 24 complete and 7 interrupted iterations
smoke    Γ£ô [ 100% ] 5 VUs    20s
baseline Γ£ô [ 100% ] 1/1 VUs  1s
stress   Γ£ô [ 100% ] 1/1 VUs  1s